Revit 2027 API
ReloadSwapOutInfo.Part Property
 The ElementId of part being swapped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId Part { get; }
Public ReadOnly Property Part As ElementId
	Get
public:
property ElementId^ Part {
	ElementId^ get ();
}
member Part : ElementId with get
Property Value
ElementId
See Also
Reference
ReloadSwapOutInfo Class
Autodesk.Revit.DB Namespace